Documents/Реализация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>Реализация</Name>
			<BasedOn>
				<xr:Item>Document.Проект</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВзаиморассчетыССотрудниками</xr:Item>
				<xr:Item>AccumulationRegister.РеализацияРабот</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Проект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТрудоемкостьЭталон</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Трудоемкость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактТрудоемкость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/РеализацияРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>РеализацияРабот</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Часы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Проект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/Реализация/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ДобавитьЗадачиИзПроектаНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияРаботОстатки.Номенклатура КАК Номенклатура,
		|	РеализацияРаботОстатки.ЧасыОстаток КАК ЧасыОстаток
		|ИЗ
		|	РегистрНакопления.РеализацияРабот.Остатки(, Проект = &Проект) КАК РеализацияРаботОстатки";
	
	Запрос.УстановитьПараметр("Проект", Объект.Проект);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	
	Объект.Услуги.Очистить();
	
	Для каждого СтрокаВыборки из ВыборкаДетальныеЗаписи Цикл
		НоваяСтрока = Объект.Услуги.Добавить();
		НоваяСтрока.Номенклатура = СтрокаВыборки.Номенклатура;
		НоваяСтрока.Трудоемкость = СтрокаВыборки.ЧасыОстаток;
		НоваяСтрока.ТрудоемкостьЭталон = СтрокаВыборки.ЧасыОстаток;
		НоваяСтрока.ФактТрудоемкость = СтрокаВыборки.ЧасыОстаток;
	КонецЦикла;
	
	ИтогТаблицы = Объект.Услуги.Итог("НомерСтроки");
	Если ИтогТаблицы Тогда
		Сообщить("Нет задач для выполнения");
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗадачиИзПроекта(Команда)
	ДобавитьЗадачиИзПроектаНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура УслугиТрудоемкостьПриИзменении(Элемент)
	ТекСтрока = ТекущийЭлемент.ТекущиеДанные;
	
	Если ТекСтрока.Трудоемкость > ТекСтрока.ТрудоемкостьЭталон Тогда
		ТекСтрока.Трудоемкость = ТекСтрока.ТрудоемкостьЭталон;
		Сообщить("Трудоемкость данной задачи не может быть больше общей оставшейся трудоемкости");
	КонецЕсли	
КонецПроцедуры
